tests/performance/IS_Test_Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="IS_Load_Test_Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Plan HTTP Request Defaults">
        <stringProp name="HTTPSampler.domain">${__groovy(props.get(&quot;test_mode&quot;) == &quot;proxy&quot; ? (props.get(&quot;Apim_Env&quot;) + vars.get(&quot;Apim_Domain&quot;)) : props.get(&quot;ServiceEndpoint&quot;))}</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <CacheManager guiclass="CacheManagerGui" testclass="CacheManager" testname="Plan HTTP Cache Manager">
        <boolProp name="clearEachIteration">true</boolProp>
        <boolProp name="useExpires">true</boolProp>
        <boolProp name="CacheManager.controlledByThread">false</boolProp>
      </CacheManager>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="Apim_Domain" elementType="Argument">
            <stringProp name="Argument.name">Apim_Domain</stringProp>
            <stringProp name="Argument.value">.api.service.nhs.uk</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp Thread Group">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Set Test Mode Variables">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">// Set boolean properties based on test_mode property
log.info(&quot;Setting test mode variables&quot;)
def testMode = props.get(&quot;test_mode&quot;)
props.put(&quot;isProxyMode&quot;, (testMode == &quot;proxy&quot;).toString())
props.put(&quot;isLoadMode&quot;, (testMode == &quot;load&quot;).toString())
props.put(&quot;isStressMode&quot;, (testMode == &quot;stress&quot;).toString())

log.info(&quot;Test mode: ${testMode}, isProxyMode: ${props.get(&apos;isProxyMode&apos;)}, isLoadMode: ${props.get(&apos;isLoadMode&apos;)}, isStressMode: ${props.get(&apos;isStressMode&apos;)}&quot;)

def scriptFile = new File(&apos;./scripts/LoadParams.groovy&apos;)
def scriptText = scriptFile.text
evaluate(scriptText)

log.info(props.get(&quot;test_mode&quot;) == &quot;proxy&quot; ? (props.get(&quot;Apim_Env&quot;) + props.get(&quot;Apim_Domain&quot;)) : props.get(&quot;ServiceEndpoint&quot;))</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Get Token - Proxy">
        <stringProp name="ThreadGroup.num_threads">${__P(token_num_threads,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(token_ramp_time,1)}</stringProp>
        <stringProp name="ThreadGroup.duration">${__P(duration+10,30)}</stringProp>
        <stringProp name="ThreadGroup.delay">${__P(token_startup_delay,0)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">stoptestnow</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${__P(token_loop_count,-1)}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If Controller">
          <stringProp name="IfController.condition">${__P(isProxyMode,)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Generate JWT and Bearer Token  Transaction Controller">
            <boolProp name="TransactionController.includeTimers">false</boolProp>
          </TransactionController>
          <hashTree>
            <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="AWS Secrets Manager - JSR223 PreProcessor">
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="cacheKey">false</stringProp>
              <stringProp name="script">// AWS SDK JARs must be placed in JMETER_HOME/lib directory
// Required JARs (download from Maven Central):
// - aws-java-sdk-secretsmanager-1.12.529.jar
// - aws-java-sdk-core-1.12.529.jar

import com.amazonaws.auth.DefaultAWSCredentialsProviderChain
import com.amazonaws.services.secretsmanager.AWSSecretsManagerClientBuilder
import com.amazonaws.services.secretsmanager.model.GetSecretValueRequest
import com.amazonaws.services.secretsmanager.model.GetSecretValueResult
import groovy.json.JsonSlurper

try {
    // Get the secret name from JMeter property (set via -J option) or variable
    String secretName = props.get(&quot;AWS_SECRET_NAME&quot;) ?: vars.get(&quot;AWS_SECRET_NAME&quot;)
    String region = props.get(&quot;AWS_REGION&quot;) ?: vars.get(&quot;AWS_REGION&quot;) ?: &quot;eu-west-2&quot;
    String awsProfile = props.get(&quot;AWS_PROFILE&quot;) ?: vars.get(&quot;AWS_PROFILE&quot;) ?: &quot;default&quot;


    log.info(&quot;Fetching secret: ${secretName} from region: ${region}&quot;)

    // Create AWS Secrets Manager client using default credentials chain
    // This will use: environment variables, system properties, AWS credentials file, IAM role
    def client = AWSSecretsManagerClientBuilder.standard()
        .withRegion(region)
        .withCredentials(new DefaultAWSCredentialsProviderChain())
        .build()

    // Create request to get secret value
    GetSecretValueRequest getSecretValueRequest = new GetSecretValueRequest()
        .withSecretId(secretName)

    // Retrieve the secret
    GetSecretValueResult getSecretValueResult = client.getSecretValue(getSecretValueRequest)
    String secretString = getSecretValueResult.getSecretString()

    log.info(&quot;Successfully retrieved secret&quot;)

    // Parse the JSON secret string
    def jsonSlurper = new JsonSlurper()
    def secretJson = jsonSlurper.parseText(secretString)

    // Process key-value pairs and set them as JMeter variables
    secretJson.each { key, value -&gt;
        vars.put(key as String, value as String)
        log.info(&quot;Set variable: ${key}&quot;)
    }

    log.info(&quot;Successfully processed ${secretJson.size()} key-value pairs from secret&quot;)

} catch (ClassNotFoundException e) {
    log.error(&quot;AWS SDK classes not found. Please ensure AWS SDK JARs are in JMETER_HOME/lib directory&quot;)
    log.error(&quot;Error: ${e.message}&quot;, e)
} catch (Exception e) {
    log.error(&quot;Error fetching or processing AWS secret: ${e.message}&quot;, e)
    e.printStackTrace()
    // Optionally fail the test or continue with default values
    // throw e
}
</stringProp>
            </JSR223PreProcessor>
            <hashTree/>
            <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Generate JWT Token - JSR223 PreProcessor" enabled="true">
              <stringProp name="cacheKey">false</stringProp>
              <stringProp name="script">import com.auth0.jwt.JWT;
import com.auth0.jwt.algorithms.Algorithm;

import java.io.IOException;
import java.security.KeyFactory;
import java.security.interfaces.RSAPrivateKey;
import java.security.spec.PKCS8EncodedKeySpec;
import java.util.Base64;
import java.util.Date;
import java.util.Map;
import java.util.UUID;
import java.nio.file.Files;
import java.nio.file.Path;
import java.io.IOException;


public static String readFileContent(Path filePath) throws IOException {
    return new String(Files.readAllBytes(filePath));
}
    String apikey = vars.get(&quot;api_key&quot;);
    String kid_name = vars.get(&quot;kid&quot;);
    String key = vars.get(&quot;private_key&quot;)
    tokenExpireTime = 300000;
//    String key = readFileContent(Path.of(&quot;parameter_files/&quot;+kid_name+&quot;.pem&quot;));


    // Set cert to the main part of the key
    String[] parts = key.split(&quot;-----&quot;);
    String cert = parts[2];

    // Load private key file
    String privateKeyPem = cert.replaceAll(&quot;\\s&quot;, &quot;&quot;);


    byte[] keyBytes = Base64.getDecoder().decode(privateKeyPem);
    PKCS8EncodedKeySpec spec = new PKCS8EncodedKeySpec(keyBytes);
    KeyFactory kf = KeyFactory.getInstance(&quot;RSA&quot;);
    RSAPrivateKey privateKey = (RSAPrivateKey) kf.generatePrivate(spec);

    String apim_env = props.get(&quot;Apim_Env&quot;);
    String apim_domain = props.get(&quot;Apim_Domain&quot;);
    String fullendpoint = vars.get(&quot;token_url&quot;);
    String subject = apikey;
    String issuer = apikey;
    String audience = fullendpoint;
    String jwtId = UUID.randomUUID().toString();
    long nowMillis = System.currentTimeMillis();
    long expMillis;
    if(tokenExpireTime==5000000){
        expMillis = nowMillis;
    } else {
          expMillis = nowMillis + tokenExpireTime; // 5 minutes
    }

    Algorithm algorithm = Algorithm.RSA512(null, privateKey);

    def JWT_Token = JWT.create()
            .withSubject(subject)
            .withIssuer(issuer)
            .withAudience(audience)
            .withJWTId(jwtId)
            .withExpiresAt(new Date(expMillis))
            .withHeader(Map.of(&quot;kid&quot;, kid_name))
            .sign(algorithm);

    //Save the JWT in the compact string in the jmeter variables
    vars.put(&quot;JWT_Token&quot;, JWT_Token);
</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PreProcessor>
            <hashTree/>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get Bearer Token" enabled="true">
              <stringProp name="HTTPSampler.path">/oauth2/token</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="grant_type" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">client_credentials</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                    <boolProp name="HTTPArgument.use_equals">true</boolProp>
                    <stringProp name="Argument.name">grant_type</stringProp>
                    <stringProp name="HTTPArgument.content_type">text/plain</stringProp>
                  </elementProp>
                  <elementProp name="client_assertion_type" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">urn:ietf:params:oauth:client-assertion-type:jwt-bearer</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                    <boolProp name="HTTPArgument.use_equals">true</boolProp>
                    <stringProp name="Argument.name">client_assertion_type</stringProp>
                    <stringProp name="HTTPArgument.content_type">text/plain</stringProp>
                  </elementProp>
                  <elementProp name="client_assertion" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">${JWT_Token}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                    <boolProp name="HTTPArgument.use_equals">true</boolProp>
                    <stringProp name="Argument.name">client_assertion</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
            </HTTPSamplerProxy>
            <hashTree>
              <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
                <collectionProp name="HeaderManager.headers">
                  <elementProp name="" elementType="Header">
                    <stringProp name="Header.name">content-type</stringProp>
                    <stringProp name="Header.value">application/x-www-form-urlencoded</stringProp>
                  </elementProp>
                </collectionProp>
              </HeaderManager>
              <hashTree/>
              <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Bearer Token" enabled="true">
                <stringProp name="JSONPostProcessor.referenceNames">varBearer</stringProp>
                <stringProp name="JSONPostProcessor.jsonPathExprs">$.access_token</stringProp>
                <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
                <stringProp name="JSONPostProcessor.defaultValues">TOKEN_NOT_FOUND</stringProp>
              </JSONPostProcessor>
              <hashTree/>
              <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Set Bearer Token as Property" enabled="true">
                <stringProp name="cacheKey">true</stringProp>
                <stringProp name="script">// Set the bearer token as a JMeter property so it&apos;s available across all thread groups
def bearerToken = vars.get(&quot;varBearer&quot;)
def iteration = vars.getIteration()

if (bearerToken != null &amp;&amp; !bearerToken.isEmpty() &amp;&amp; bearerToken != &quot;TOKEN_NOT_FOUND&quot;) {
    props.put(&quot;varBearer&quot;, bearerToken)
    log.info(&quot;Iteration ${iteration}: Bearer token successfully set&quot;)
} else {
    log.error(&quot;Iteration ${iteration}: Bearer token is null!&quot;)
}
</stringProp>
                <stringProp name="scriptLanguage">groovy</stringProp>
              </JSR223PostProcessor>
              <hashTree/>
            </hashTree>
          </hashTree>
          <JSR223Timer guiclass="TestBeanGUI" testclass="JSR223Timer" testname="Wait 5 Minutes (Skip First Iteration)">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">// Only wait on iterations after the first one
def iteration = vars.getIteration()
if (iteration == 1) {
    return 0  // No delay on first iteration
} else {
    return 290000  // 5 minutes (300000 ms) on subsequent iterations
}
</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Timer>
          <hashTree/>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Stop Thread if NOT Proxy Mode">
          <stringProp name="IfController.condition">${__groovy(!props.get(&apos;isProxyMode&apos;) || props.get(&apos;isProxyMode&apos;) == &apos;false&apos;)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Flow Control Action - Stop Thread">
            <intProp name="ActionProcessor.action">2</intProp>
            <intProp name="ActionProcessor.target">0</intProp>
            <stringProp name="ActionProcessor.duration">0</stringProp>
          </TestAction>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Organization Search Backend - Precise Throughput">
        <stringProp name="ThreadGroup.num_threads">${__P(num_threads,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp_time,1)}</stringProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,10)}</stringProp>
        <stringProp name="ThreadGroup.delay">${__P(startup_delay,0)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${__P(loop_count,-1)}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If Controller">
          <stringProp name="IfController.condition">${__P(isLoadMode,)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Organization Request">
            <stringProp name="HTTPSampler.path">Organization?_revinclude=Endpoint%3Aorganization&amp;identifier=odsOrganisationCode%7C${ep_odscode}</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="ODSCode Parameters" enabled="true">
              <stringProp name="delimiter">,</stringProp>
              <stringProp name="filename">parameter_files/dos_search_odscodes.csv</stringProp>
              <boolProp name="ignoreFirstLine">true</boolProp>
              <boolProp name="quotedData">false</boolProp>
              <boolProp name="recycle">true</boolProp>
              <stringProp name="shareMode">shareMode.group</stringProp>
              <boolProp name="stopThread">false</boolProp>
              <stringProp name="variableNames">ep_odscode</stringProp>
            </CSVDataSet>
            <hashTree/>
            <PreciseThroughputTimer guiclass="TestBeanGUI" testclass="PreciseThroughputTimer" testname="Precise Throughput Timer">
              <doubleProp>
                <name>allowedThroughputSurplus</name>
                <value>1.0</value>
                <savedValue>0.0</savedValue>
              </doubleProp>
              <intProp name="batchSize">1</intProp>
              <intProp name="batchThreadDelay">0</intProp>
              <stringProp name="duration">${__P(duration,3660)}</stringProp>
              <intProp name="exactLimit">10000</intProp>
              <longProp name="randomSeed">1</longProp>
              <stringProp name="throughput">${__P(timer_throughput,9000.0)}</stringProp>
              <stringProp name="throughputPeriod">${__P(timer_throughput_period,60)}</stringProp>
            </PreciseThroughputTimer>
            <hashTree/>
          </hashTree>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Stop If Not Load Mode">
          <stringProp name="IfController.condition">${__groovy(!props.get(&apos;isLoadMode&apos;) || props.get(&apos;isLoadMode&apos;) == &apos;false&apos;)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Flow Control Action">
            <intProp name="ActionProcessor.action">2</intProp>
            <intProp name="ActionProcessor.target">0</intProp>
            <stringProp name="ActionProcessor.duration">0</stringProp>
          </TestAction>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Organization Search Proxy - Precise Throughput">
        <stringProp name="ThreadGroup.num_threads">${__P(num_threads,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp_time,1)}</stringProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,10)}</stringProp>
        <stringProp name="ThreadGroup.delay">${__P(startup_delay,10)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${__P(loop_count,-1)}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If Controller" enabled="true">
          <stringProp name="IfController.condition">${__P(isProxyMode,)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Organization Search Transaction Controller">
            <boolProp name="TransactionController.parent">true</boolProp>
            <boolProp name="TransactionController.includeTimers">false</boolProp>
          </TransactionController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Organization Request">
              <stringProp name="HTTPSampler.path">/dos-search/FHIR/R4/Organization?_revinclude=Endpoint%3Aorganization&amp;identifier=odsOrganisationCode%7C${ep_odscode}</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
                <collectionProp name="Arguments.arguments"/>
              </elementProp>
            </HTTPSamplerProxy>
            <hashTree>
              <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="ODSCode Parameters" enabled="true">
                <stringProp name="delimiter">,</stringProp>
                <stringProp name="filename">parameter_files/dos_search_odscodes.csv</stringProp>
                <boolProp name="ignoreFirstLine">true</boolProp>
                <boolProp name="quotedData">false</boolProp>
                <boolProp name="recycle">true</boolProp>
                <stringProp name="shareMode">shareMode.group</stringProp>
                <boolProp name="stopThread">false</boolProp>
                <stringProp name="variableNames">ep_odscode</stringProp>
              </CSVDataSet>
              <hashTree/>
              <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
                <collectionProp name="HeaderManager.headers">
                  <elementProp name="" elementType="Header">
                    <stringProp name="Header.name">Authorization</stringProp>
                    <stringProp name="Header.value">Bearer ${__P(varBearer,${varBearer})}</stringProp>
                  </elementProp>
                </collectionProp>
              </HeaderManager>
              <hashTree/>
              <PreciseThroughputTimer guiclass="TestBeanGUI" testclass="PreciseThroughputTimer" testname="Precise Throughput Timer">
                <doubleProp>
                  <name>allowedThroughputSurplus</name>
                  <value>1.0</value>
                  <savedValue>0.0</savedValue>
                </doubleProp>
                <intProp name="batchSize">1</intProp>
                <intProp name="batchThreadDelay">0</intProp>
                <stringProp name="duration">${__P(duration,3660)}</stringProp>
                <intProp name="exactLimit">10000</intProp>
                <longProp name="randomSeed">1</longProp>
                <stringProp name="throughput">${__P(timer_throughput,9000.0)}</stringProp>
                <stringProp name="throughputPeriod">${__P(timer_throughput_period,60)}</stringProp>
              </PreciseThroughputTimer>
              <hashTree/>
            </hashTree>
          </hashTree>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Stop If Not Proxy Mode" enabled="true">
          <stringProp name="IfController.condition">${__groovy(!props.get(&apos;isProxyMode&apos;) || props.get(&apos;isProxyMode&apos;) == &apos;false&apos;)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Flow Control Action" enabled="true">
            <intProp name="ActionProcessor.action">2</intProp>
            <intProp name="ActionProcessor.target">0</intProp>
            <stringProp name="ActionProcessor.duration">0</stringProp>
          </TestAction>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Organization Requests Backend - Throughput Shaping Timer">
        <stringProp name="ThreadGroup.num_threads">${__P(num_threads,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp_time,1)}</stringProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,10)}</stringProp>
        <stringProp name="ThreadGroup.delay">${__P(startup_delay,0)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${__P(loop_count,-1)}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If Controller">
          <stringProp name="IfController.condition">${__P(isStressMode,)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer">
            <collectionProp name="load_profile">
              <collectionProp name="656718665">
                <stringProp name="start">0</stringProp>
                <stringProp name="end">${__P(throughput_step,50)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
              <collectionProp name="1797909186">
                <stringProp name="start">${__P(throughput_step,50)}</stringProp>
                <stringProp name="end">${__P(throughput_step,50)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
              <collectionProp name="405047607">
                <stringProp name="-503223748">${__groovy(${__P(throughput_step,50)} * 2)}</stringProp>
                <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 2)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
              <collectionProp name="-2023507902">
                <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 3)}</stringProp>
                <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 3)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
              <collectionProp name="-2022554590">
                <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 4)}</stringProp>
                <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 4)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
              <collectionProp name="-2021601278">
                <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 5)}</stringProp>
                <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 5)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
              <collectionProp name="-2020647966">
                <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 6)}</stringProp>
                <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 6)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
              <collectionProp name="-2019694654">
                <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 7)}</stringProp>
                <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 7)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
              <collectionProp name="-2018741342">
                <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 8)}</stringProp>
                <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 8)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
              <collectionProp name="-2017788030">
                <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 9)}</stringProp>
                <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 9)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
              <collectionProp name="-1437579198">
                <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 10)}</stringProp>
                <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 10)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
              <collectionProp name="-1436625886">
                <stringProp name="start">${__groovy(${__P(throughput_step,50)} * 11)}</stringProp>
                <stringProp name="end">${__groovy(${__P(throughput_step,50)} * 11)}</stringProp>
                <stringProp name="duration">${__P(step_duration,300)}</stringProp>
              </collectionProp>
            </collectionProp>
          </kg.apc.jmeter.timers.VariableThroughputTimer>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Organization Request">
            <stringProp name="HTTPSampler.path">Organization?_revinclude=Endpoint%3Aorganization&amp;identifier=odsOrganisationCode%7C${ep_odscode}</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="ODSCode Parameters" enabled="true">
              <stringProp name="delimiter">,</stringProp>
              <stringProp name="filename">parameter_files/dos_search_odscodes.csv</stringProp>
              <boolProp name="ignoreFirstLine">true</boolProp>
              <boolProp name="quotedData">false</boolProp>
              <boolProp name="recycle">true</boolProp>
              <stringProp name="shareMode">shareMode.group</stringProp>
              <boolProp name="stopThread">false</boolProp>
              <stringProp name="variableNames">ep_odscode</stringProp>
            </CSVDataSet>
            <hashTree/>
          </hashTree>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Stop Thread if NOT Stress Mode" enabled="true">
          <stringProp name="IfController.condition">${__groovy(!props.get(&apos;isStressMode&apos;) || props.get(&apos;isStressMode&apos;) == &apos;false&apos;)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Flow Control Action - Stop Thread" enabled="true">
            <intProp name="ActionProcessor.action">2</intProp>
            <intProp name="ActionProcessor.target">0</intProp>
            <stringProp name="ActionProcessor.duration">0</stringProp>
          </TestAction>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>